Revit 2026 API

# ElementTransformUtilsMoveElement Method

---

Moves one element by a given transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void MoveElement(
	Document document,
	ElementId elementToMove,
	XYZ translation
)
```
```vb
Public Shared Sub MoveElement (
	document As Document,
	elementToMove As ElementId,
	translation As XYZ
)
```
```cpp
public:
static void MoveElement(
	Document^ document,
	ElementId^ elementToMove,
	XYZ^ translation
)
```
```fsharp
static member MoveElement :
        document : Document *
        elementToMove : ElementId *
        translation : XYZ -> unit
```

#### Parameters

document Document
     The document that owns the elements.
elementToMove ElementId
     The id of the element to move.
translation XYZ
     The translation vector for the elements.

| Exception | Condition |
| --- | --- |
| ArgumentException | The element elementToMove does not exist in the document |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | If we are not able to move the element (for example, if it is pinned). -or- Move operation failed. |

#### Reference

ElementTransformUtils Class

Autodesk.Revit.DB Namespace